tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "aircrack-ng"
brew "ansible"
brew "python"
brew "asciinema"
brew "gettext"
brew "autoconf"
brew "automake"
brew "bash", link: false
brew "binutils"
brew "bison"
brew "blackbox"
brew "boost"
brew "cabal-install"
brew "cassandra"
brew "cmake"
brew "coreutils"
brew "cquery"
brew "cscope", link: false
brew "ctags"
brew "curl"
brew "cython"
brew "elixir"
brew "entr"
brew "exiftags"
brew "expect"
brew "fasd"
brew "ffmpeg"
brew "findutils"
brew "fswatch"
brew "fzf"
brew "mpfr"
brew "gawk", link: false
brew "gcc"
brew "gdb"
brew "geoip"
brew "gifsicle"
brew "git"
brew "git-flow"
brew "go"
brew "gnu-tar"
brew "grep"
brew "gron"  # Grep json
brew "gtk+"
brew "gzip"
brew "htop"
brew "httpie"
brew "hub"
brew "iftop"
brew "libtool", args: ["universal"]
brew "imagemagick"
brew "ipython"
brew "ipython@5"
brew "ispell"
brew "jasper", args: ["universal"]
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "jython"
brew "less"
brew "libarchive"
brew "libev"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns", args: ["universal"]
brew "libident"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "little-cms2"
brew "lua"
brew "luajit"
brew "m-cli"
brew "markdown", link: false
brew "mercurial"
brew "subversion"
brew "msgpack"
brew "multimarkdown"
brew "multitail"
brew "mysql"
brew "nanomsg"
brew "neon"
brew "unibilium"
brew "neovim"
brew "net-snmp"
brew "nmap"
brew "node"
brew "nvm"
brew "ocaml"
brew "ossp-uuid"
brew "osxutils"
brew "p7zip"
brew "pandoc"
brew "pigz"
brew "popt"
brew "postgresql", restart_service: true
brew "protobuf"
brew "pstree"
brew "psutils"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python@2"
brew "rbenv"
brew "redis"
brew "rg"
brew "rpm"
brew "rpm2cpio"
brew "ruby"
brew "ruby-build"
brew "rust"
brew "scons"
brew "shellcheck"
brew "sphinx"
brew "swig"
brew "tcl-tk"
brew "tig"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "vim", args: ["override-system-vi", "with-python@2"]
brew "wget"
brew "wine"
brew "wireshark", args: ["with-x"]
brew "yarn"
brew "z"
brew "zlib"
brew "zstd"

cask "homebrew/cask-fonts/font-terminus"
cask "Karabiner-elements"  # Any keyboard shortcut
cask "Spectacle"   # Move windows around with shortcuts
cask "Iterm2"
cask "Dropbox"
cask "google-chrome"
cask "Firefox"
cask "LaunchBar"   # Spotlight replacement
cask "keepassxc"   # Passwd manager
cask "macvim"      # Vim with a nice Mac GUI
cask "meld"        # Three way merge tool (GTK :( )
cask "qlmarkdown"  # Quicklook (spacebar in Finder) for markdown preview
cask "qlstephen"   # Quicklook (spacebar in Finder) for extension-less files (README, etc)
cask "spotify"
cask "vagrant"
cask "vimr"        # Nice/fast Neovim Gui
cask "time-out"
cask "copyq"

# Fuse stuff
cask "osxfuse"
brew "ntfs-3g"

# JDK-related things
cask "java"
brew "groovy"
brew "ant"
brew "maven"
brew "gradle"
brew "pmd"

# Emacs-plus / spacemacs
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus", link: false

# See https://github.com/aykamko/tag
# Maybe start using it?
# tap "aykamko/tag-ag"
# brew "aykamko/tag-ag/tag-ag"

# I'm using emacs-plus for spacemacs
# brew "emacs", args: ["HEAD", "with-cocoa", "with-gnutls"], link: false

# I'm using emacs-plus for spacemacs
# tap "railwaycat/emacsmacport"
# brew "railwaycat/emacsmacport/emacs-mac"
# cask "railwaycat/emacsmacport/emacs-mac"

mas "feedly", id: 865500966
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Musicnotes", id: 1025073421
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Remote Desktop", id: 409907375
mas "Slack", id: 803453959
