tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "ansible"
brew "arping"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bazelisk"
brew "binutils"
brew "bison"
brew "boost"
brew "buildifier"
brew "buildozer"
brew "bzip2"
brew "gettext"
brew "glib"
brew "cairo"
brew "cassandra"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "cython"
brew "docker"
brew "docker-credential-helper"
brew "elixir"
brew "enchant"
brew "entr"
brew "exiftags"
brew "expect"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "findutils"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "gnu-tar"
brew "graphviz"
brew "grep"
brew "gzip"
brew "htop"
brew "hub"
brew "iftop"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lcov"
brew "less"
brew "ruby"
brew "minikube"
brew "libarchive"
brew "libev"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns", args: ["universal"]
brew "libident"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "lua"
brew "luajit"
brew "markdown"
brew "msgpack"
brew "multimarkdown"
brew "multitail"
brew "mysql"
brew "neovim"
brew "nmap"
brew "node"
brew "osxutils"
brew "p7zip"
brew "pandoc"
brew "pigz"
brew "postgresql", restart_service: true
brew "protobuf"
brew "pstree"
brew "psutils"
brew "pyenv"
brew "python"
brew "python@2"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rpm"
brew "the_silver_searcher"
brew "rpm2cpio"
brew "ruby"
brew "ruby-build"
brew "rust"
brew "scons"
brew "shellcheck"
brew "sphinx"
brew "swig"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "watch"
brew "yarn"
brew "yq"
brew "z"
brew "zlib"
brew "zstd"

cask "Karabiner-elements"  # Any keyboard shortcut
cask "Spectacle"   # Move windows around with shortcuts
cask "Iterm2"
cask "Dropbox"
cask "Firefox"
cask "LaunchBar"   # Spotlight replacement
cask "qlmarkdown"  # Quicklook (spacebar in Finder) for markdown preview
cask "qlstephen"   # Quicklook (spacebar in Finder) for extension-less files (README, etc)
cask "spotify"
cask "vimr"        # Nice/fast Neovim Gui
cask "time-out"
cask "copyq"
cask "osxfuse"
cask "pgadmin4"
cask "wireshark"

mas "1Password 7", id: 1333542190
mas "CalcMadeEasy", id: 417402227
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Musicnotes", id: 1025073421
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
